# -*- mode: ruby -*-
cask_args appdir: '/Applications'

tap 'homebrew/services'


brew 'aspell'
brew 'awscli'
brew 'fzf'
brew 'git'
brew 'go'
brew 'hub'
brew 'kubernetes-cli' # kubectl
brew 'python'
brew 'python3'
brew 'the_silver_searcher'
brew 'tmux'
brew 'wget'
brew 'xhyve'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'

# ZSH
brew 'antigen'

tap 'neovim/neovim'
brew 'neovim'

tap 'heroku/brew'
brew 'heroku'


brew 'docker-completion'
brew 'docker-compose-completion'


tap 'caskroom/cask'
cask 'alfred'
cask 'atom'
cask 'docker'
cask 'dropbox'
cask 'emacs'
cask 'foldingtext'
cask 'google-chrome'
cask 'iterm2'
cask 'keepingyouawake'
cask 'omnifocus'
cask 'rocket'
cask 'skype'
cask 'spotify'
cask 'typora'
cask 'virtualbox'


tap 'caskroom/fonts'
cask 'font-inconsolata'
cask 'font-fira-mono'


mas '1Password',     id: 443987910
mas 'Bear',          id: 1091189122
mas 'Evernote',      id: 406056744
mas 'Fantastical 2', id: 975937182
mas 'Slack',         id: 803453959
mas 'Tweetbot',      id: 557168941
mas 'UnPlugged',     id: 423123087
