# -*- mode: ruby -*-
cask_args appdir: '/Applications'

tap 'homebrew/services'


brew 'aspell'
brew 'awscli'
brew 'bat'
brew 'bottom'
brew 'dust'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'git-delta'
brew 'gh'
brew 'git'
brew 'go'
brew 'hub'
brew 'kubernetes-cli'
brew 'node'
brew 'pnpm'
brew 'poetry'
brew 'python3'
brew 'ripgrep'
brew 'sd'
brew 'the_silver_searcher'
brew 'tree-sitter'
brew 'wget'
brew 'fish'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'
brew 'starship'
brew 'tealdeer'
brew 'zoxide'

# ZSH
brew 'antigen'

tap 'neovim/neovim'
brew 'neovim'

tap 'homebrew/cask'
cask 'choosy'
cask 'claude-code'
cask 'google-chrome'
cask 'finicky'
cask 'iterm2'
cask 'keepingyouawake'
cask 'superhuman'
cask 'thingsmacsandboxhelper'
cask 'visual-studio-code'


tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-font'
