# -*- mode: ruby -*-
cask_args appdir: '/Applications'

tap 'homebrew/services'


brew 'aspell'
brew 'awscli'
brew 'fzf'
brew 'git'
brew 'go'
brew 'hub'
brew 'kubernetes-cli' # kubectl
brew 'python'
brew 'python3'
brew 'the_silver_searcher'
brew 'tmux'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'

# ZSH
brew 'antigen'

tap 'neovim/neovim'
brew 'neovim'

tap 'heroku/brew'
brew 'heroku'


brew 'docker-completion'
brew 'docker-compose-completion'


tap 'homebrew/cask'
cask 'alfred'
cask 'choosy'
cask 'docker'
cask 'dropbox'
cask 'emacs'
cask 'google-chrome'
cask 'finicky'
cask 'iterm2'
cask 'keepingyouawake'
cask 'omnifocus'
cask 'rocket'
cask 'skype'
cask 'superhuman'
cask 'thingsmacsandboxhelper'
cask 'typora'
cask 'visual-studio-code'


tap 'homebrew/cask-fonts'
cask 'font-ibm-plex'
cask 'font-inconsolata'
cask 'font-fira-mono'
cask 'font-fira-code'


mas '1Password 7',          id: 1333542190
mas 'Bear',                 id: 1091189122
mas 'Evernote',             id: 406056744
mas 'Evernote Web Clipper', id: 1481669779
mas 'Fantastical',          id: 975937182
mas 'Ghostery Lite',        id: 1436953057
mas 'Hand Mirror',          id: 1502839586
mas 'Hush',                 id: 1544743900
mas 'Instapaper Save',      id: 1481302432
mas 'Mindnode',             id: 1289197285
mas 'Moom',                 id: 419330170
mas 'Slack',                id: 803453959
mas 'Things',               id: 904280696
mas 'Tweetbot',             id: 557168941
mas 'UnPlugged',            id: 423123087
